exampleCases/freeSurfaceorg/constant/kinematicCloudPositions
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2006                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       vectorField;
    object      kinematicCloudPositions;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //


(
(10e-6 100e-6 0)
(20e-6 100e-6 0)
(30e-6 100e-6 0)
(40e-6 100e-6 0)
(50e-6 100e-6 0)
(60e-6 100e-6 0)
(70e-6 100e-6 0)
(80e-6 100e-6 0)
(90e-6 100e-6 0)
(100e-6 100e-6 0)
)

// ************************************************************************* //
