exampleCases/freeSurfaceorg/constant/thermophysicalProperties.oil
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2006                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      thermophysicalProperties.oil;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

thermoType
{
    type            heRhoThermo;
    mixture         pureMixture;
    transport       const;
    thermo          hConst;
    equationOfState adiabaticPerfectFluid;
    specie          specie;
    energy          sensibleInternalEnergy;
}

mixture
{
    specie
    {
        molWeight   74.15;
    }
    equationOfState
    {
        B           0;
        rho0        0.12;
        p0          10320;
        gamma       1.33;
        //R           3564;
        //rho0        980;
    }
    thermodynamics
    {
        Cp          2240;
        Hf          0;
    }
    transport
    {
        mu          1.3e-05;
        Pr          6;
    }
}


// ************************************************************************* //
