exampleCases/freeSurfaceorg/constant/transportProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  dev                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      transportProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

sheetThickness  sheetThickness [0 1 0 0 0 0 0] 0e-6; //50e-6

BubbleRadius    BubbleRadius [0 1 0 0 0 0 0] 22e-6;
epsilonBubble   epsilonBubble [0 0 0 0 0 0 0] 1e-12;//to narrow the bubble interface
BubbleCenter    BubbleCenter [0 1 0 0 0 0 0] (0 -500e-6 0);

pBubble         pBubble [ 1 -1 -2 0 0 0 0 ] 200e5;
pliquid         pliquid [ 1 -1 -2 0 0 0 0 ] 101325;
pFact           pFact [ 0 0 0 0 0 0 0 ] 0.3;

epsDtB_air      epsDtB_air [0 2 0 0 0 0 0] 4e-11;// used to smear the bubble interface
epsDtB_oil      epsDtB_oil [0 2 0 0 0 0 0] 0;// used to smear the oil interface

rhoMin          rhoMin [1 -3 0 0 0 0 0] 0;
rhoMax          rhoMax [1 -3 0 0 0 0 0] 1e10;

// ************************************************************************* //
