exampleCases/freeSurfaceorg/system/setFieldsDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2006                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      setFieldsDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

defaultFieldValues
(
    volScalarFieldValue alpha.air 0
    volScalarFieldValue alpha.water 1
    volScalarFieldValue alphas 0
    volScalarFieldValue alpha.oil 0
    volVectorFieldValue U (0 0 0)
    volScalarFieldValue p 101325
    volScalarFieldValue p_rgh 101325
);

regions
(
    sphereToCell
    {
        centre (0 2e-3 0);
        radius 50e-6;
        fieldValues
        (
            volScalarFieldValue alpha.water 0
            volScalarFieldValue alpha.oil 0
            volScalarFieldValue alpha.air 1
            volScalarFieldValue alphas 2
    volScalarFieldValue p 100e5
    volScalarFieldValue p_rgh 100e5
        );
    }
    boxToCell
    {
        box (-1 -1 -1) (1 0.2e-3 1);
        fieldValues
        (
            volScalarFieldValue alpha.water 0
            volScalarFieldValue alpha.oil 1
            volScalarFieldValue alpha.air 0
            volScalarFieldValue alphas 1
    volScalarFieldValue p 101325
    volScalarFieldValue p_rgh 101325
        );
    }
);


// ************************************************************************* //
